In [32]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [43]:
df.loc[:10, "salary_rate" : 'salary_year_avg']

   salary_rate  salary_year_avg
0         None         115000.0
1         None         115000.0
2         None         115000.0
3         None         115000.0
4         None         115000.0
5         None         115000.0
6         None         115000.0
7         None         115000.0
8         None         115000.0
9         None         115000.0
10        None         115000.0

In [34]:
median_salary_year = df['salary_year_avg'].median()
median_salary_hour = df['salary_hour_avg'].median()

In [35]:
df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [36]:
df_filled.loc[:10, ['salary_year_avg', 'salary_hour_avg']]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()
df_unique

print('length before:', len(df_filled))
print('length after:', len(df_unique))
print('number of duplicates removed:', len(df_filled) - len(df_unique))

length before: 785741
length after: 785640
number of duplicates removed: 101

In [41]:
df_unique = df_unique.drop_duplicates(subset = ['job_title','company_name'])

print('length before:', len(df_filled))
print('length after:', len(df_unique))
print('number of duplicates removed:', len(df_filled) - len(df_unique))

length before: 785741
length after: 508042
number of duplicates removed: 277699